controllers/CartController.php

SELECT * FROM `products` WHERE 0=1
---
	public function actionIndex(){
		$cart = Yii::$app->session->get('cart', array());
		$ids = array_keys($cart);
		$products = Products::find()->where(array("id"=>$ids))->all();