controllers/SiteController.php

    public function actionIndex()
    {
        $products = Products::find()->all();
        $categories = Categories::find()->all();
---
SELECT * FROM `products`
SELECT * FROM `Categories`